## Pandas kütüphanesinde 10 adet fonksiyon araştırılıp kullanım örneği olan bir ipynb dosyası ile paylaşılacak.

In [1]:
import numpy as np

In [2]:
import pandas as pd

In [3]:
df= pd.read_csv("Chocolate Sales2.csv")

In [4]:
df.head()

,Sales Person,Country,Product,Date,Amount,Boxes Shipped
0,Jehu Rudeforth,UK,Mint Chip Choco,04-Jan-22,"$5,320",180.0
1,Van Tuxwell,India,85% Dark Bars,01-Aug-22,"$7,896",NaN
2,Gigi Bohling,India,Peanut Butter Cubes,NaN,"$4,501",91.0
3,Jan Morforth,Australia,Peanut Butter Cubes,27-Apr-22,NaN,NaN
4,Jehu Rudeforth,UK,NaN,24-Feb-22,"$13,685",184.0

In [5]:
df.isnull().sum()

Sales Person      0
Country          12
Product          13
Date              9
Amount            8
Boxes Shipped    11
dtype: int64

In [11]:
df['Amount']=df['Amount'].astype(str).str.replace("[$,]","",regex=True).astype(float)

In [12]:
df['Amount'].head

<bound method NDFrame.head of 0        5320.0
1        7896.0
2        4501.0
3           NaN
4       13685.0
         ...
1089     4410.0
1090     6559.0
1091      574.0
1092     2086.0
1093     5075.0
Name: Amount, Length: 1094, dtype: float64>

In [13]:
df["Country"].mode()[0]

'Australia'

In [14]:
df.groupby('Product')['Amount'].mean()

Product
50% Dark Bites          5626.694915
70% Dark Bites          5038.333333
85% Dark Bars           6032.142857
99% Dark & Pure         6147.312500
After Nines             5226.620000
Almond Choco            5715.195652
Baker's Choco Chips     6088.121951
Caramel Stuffed Bars    5385.767442
Choco Coated Almonds    6191.948718
Drinking Coco           4583.125000
Eclairs                 5165.644068
Fruit & Nut Bars        5023.285714
Manuka Honey Choco      6206.772727
Milk Bars               5494.857143
Mint Chip Choco         6310.422222
Orange Choco            5487.847826
Organic Choco Syrup     5473.142857
Peanut Butter Cubes     6466.782609
Raspberry Choco         5119.282609
Smooth Sliky Salty      5948.068966
Spicy Special Slims     5384.098039
White Choc              5674.948276
Name: Amount, dtype: float64

In [15]:
df['Date']=df['Date'].ffill().bfill()

In [16]:
df['Date'].head()

0    04-Jan-22
1    01-Aug-22
2    01-Aug-22
3    27-Apr-22
4    24-Feb-22
Name: Date, dtype: object

In [17]:
df.dropna(axis=0, how='any',inplace=True)

In [18]:
df.isnull().sum()

Sales Person     0
Country          0
Product          0
Date             0
Amount           0
Boxes Shipped    0
dtype: int64

In [19]:
df_sorted=df.sort_values(by='Amount',ascending=False)

In [20]:
df_sorted.head()

,Sales Person,Country,Product,Date,Amount,Boxes Shipped
543,Ches Bonnell,India,Peanut Butter Cubes,27-Jan-22,22050.0,208.0
135,Van Tuxwell,India,Organic Choco Syrup,16-May-22,19929.0,174.0
751,Rafaelita Blaksland,New Zealand,Eclairs,07-Feb-22,19481.0,51.0
589,Curtice Advani,India,Smooth Sliky Salty,19-Apr-22,19327.0,135.0
212,Marney O'Breen,UK,Smooth Sliky Salty,13-May-22,18991.0,88.0

In [21]:
df['Amount']=df['Amount'].apply(lambda x: x*100)

In [22]:
df['Amount'].head()

0     532000.0
1     789600.0
2     450100.0
5     537600.0
6    1368500.0
Name: Amount, dtype: float64

In [23]:
data2 = {
    'Sales Person': ['Jehu Rudeforth', 'Van Tuxwell', 'Gigi Bohling'],
    'Country': ['UK', 'India', 'India'],
    'Product': ['Mint Chip Choco', '85% Dark Bars', 'Peanut Butter Cubes']
}

df2=pd.DataFrame(data2)

In [24]:
merged_df=pd.merge(df, df2, on='Sales Person',how='inner')

In [25]:
merged_df.head()

,Sales Person,Country_x,Product_x,Date,Amount,Boxes Shipped,Country_y,Product_y
0,Jehu Rudeforth,UK,Mint Chip Choco,04-Jan-22,532000.0,180.000000,UK,Mint Chip Choco
1,Van Tuxwell,India,85% Dark Bars,01-Aug-22,789600.0,161.481994,India,85% Dark Bars
2,Gigi Bohling,India,Peanut Butter Cubes,01-Aug-22,450100.0,91.000000,India,Peanut Butter Cubes
3,Van Tuxwell,India,Smooth Sliky Salty,06-Jun-22,537600.0,38.000000,India,85% Dark Bars
4,Jehu Rudeforth,New Zealand,50% Dark Bites,20-Apr-22,399000.0,59.000000,UK,Mint Chip Choco